Revit 2026 API

# ImagePlacementOptionsLocation Property

---

The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Location { get; set; }
```
```vb
Public Property Location As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Location {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Location : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The location represents a point in the model where the ImageInstance will be placed. The location of the image in the view is determined by the projection of this point onto the plane of the view. This means that in a plan view, for example, the z-coordinate has no effect.

#### Reference

ImagePlacementOptions Class

Autodesk.Revit.DB Namespace